# Intro to Pandas

## Data Alignment

In [1]:
#Now we'll learn about arithmetic between DataFrames with different indexes
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

#### As usual we start working on Series, than we move on DF

Create Series 1

In [2]:
#Lets start by making two Series
ser1 = Series([0,1,2],index=['A','B','C'])

#Show
ser1

A    0
B    1
C    2
dtype: int64

Create Series 2

In [3]:
#Now second Series 2
ser2 = Series([3,4,5,6],index=['A','B','C','D'])

#Show 
ser2

A    3
B    4
C    5
D    6
dtype: int64

So what happens when we add these together?

In [4]:
# Addition
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

**Note:** The NaN values are added in automatically

### Now let's try it with DataFrames!

We create our first DF

In [5]:
# First df
dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['Barcelona','London'])

# Show
dframe1

           A  B
Barcelona  0  1
London     2  3

Creation of the second DF

In [6]:
#Second DataFrame
dframe2 = DataFrame(np.arange(9).reshape(3,3),columns=list('ABC'),index=['Barcelona','London','Madrid'])

#Show
dframe2

           A  B  C
Barcelona  0  1  2
London     3  4  5
Madrid     6  7  8

#### What happens when we add them together?

In [7]:
# DFs addition
dframe1 + dframe2

             A    B   C
Barcelona  0.0  2.0 NaN
London     5.0  7.0 NaN
Madrid     NaN  NaN NaN

**NOTE:** The addition will happen only where there is the match between row indexes and column names

#### What if we want to replace the NaN values?
We have to use the .add() method

In [8]:
# Then we can use .add()

dframe1.add(dframe2, fill_value=0) # it try to add 0 to every value

             A    B    C
Barcelona  0.0  2.0  2.0
London     5.0  7.0  5.0
Madrid     6.0  7.0  8.0

**Note:** Now we can see that the values are filled, however there was no "Madrid" and no "C" column in the first DF. The NaN values are replaced with the original values of the DF1

## Lets learn about operations betwen a Series and a DataFrame

In [9]:
#Show the DF2
dframe2

           A  B  C
Barcelona  0  1  2
London     3  4  5
Madrid     6  7  8

In [10]:
#Create a Series from DataFrame's 0 row
ser3 = dframe2.iloc[0]

#Show
ser3

A    0
B    1
C    2
Name: Barcelona, dtype: int32

#### Subtraction

In [11]:
#Now we can use arithmetic operations
dframe2 - ser3

           A  B  C
Barcelona  0  0  0
London     3  3  3
Madrid     6  6  6

**Note:** The arithmetic operation is performed on every row

#### Addition

In [12]:
# Show
dframe2

           A  B  C
Barcelona  0  1  2
London     3  4  5
Madrid     6  7  8

In [13]:
dframe2 + ser3

           A  B   C
Barcelona  0  2   4
London     3  5   7
Madrid     6  8  10

# Exercise!

### Next we'll learn about sorting and ranking!